tutorials/tutorialSolidMechanics/0/pFastener
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      pFastener;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    defaultName
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }
	
    centralInlet
    {
        type            zeroGradient;
    }

    leftInlet
    {
        type            zeroGradient;
    }

    rightInlet
    {
        type            zeroGradient;
    }	
	outlet
    {
        type            zeroGradient;
    }
	
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
