tutorials/tutorialSolidMechanics/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    centralInlet
    {
        type            wall;
        nFaces          1089;
        startFace       210177;
    }
    leftInlet
    {
        type            wall;
        nFaces          1089;
        startFace       211266;
    }
    rightInlet
    {
        type            wall;
        nFaces          1089;
        startFace       212355;
    }
    outlet
    {
        type            patch;
        nFaces          1089;
        startFace       213444;
    }
    defaultName
    {
        type            wall;
        nFaces          6534;
        startFace       214533;
    }
)


// ************************************************************************* //
