tutorials/tutorialSolidMechanics/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    

    {
        name    bigDistance;
        type    cellSet;
        action  new;
        source  surfaceToCell;
	
        sourceInfo
        {
     
   
		file			"geometry.stl";

		outsidePoints	((-0.010040283203125 -20.069685134823462 9.174179553985596));
		useSurfaceOrientation false;
		
		
		//enable one of the following five
		nearDistance 	1;			//-1 means deactivated, otherwise: pick all cells within [value] m of geometry.stl
		includeInside	true;		// pick all cells entirely within the geometry.stl
		includeOutside	false;		// pick all cells entirely outside of geometry.stl
		includeCut		true;		// pick all cells intersected by geometry.stl
		curvature		-100;		//-100 means deactivated, combine this with nearDistance
			
		}
	}
	{
		name    smallDistance;
        type    cellSet;
        action  new;
        source  surfaceToCell;
	
        sourceInfo
        {
     
   
		file			"geometry.stl";

		outsidePoints	((-0.010040283203125 -20.069685134823462 9.174179553985596));
		useSurfaceOrientation false;
		
		
		//enable one of the following five
		nearDistance 	0.1;			//-1 means deactivated, otherwise: pick all cells within [value] m of geometry.stl
		includeInside	true;		// pick all cells entirely within the geometry.stl
		includeOutside	false;		// pick all cells entirely outside of geometry.stl
		includeCut		true;		// pick all cells intersected by geometry.stl
		curvature		-100;		//-100 means deactivated, combine this with nearDistance
			
		}
		

	}
);





// ************************************************************************* //
